In [94]:
import numpy as np
import pandas as pd
import seaborn as sns

In [95]:
t = sns.load_dataset('titanic')
t

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [96]:
# t.to_csv('titanic.csv')

In [97]:
# merge 融合函数
class display(object):
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

# 透视表能够做任何groupby可以做的事

In [98]:
# 不同性别生存率
t.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [121]:
a = t.groupby(['sex','class'])['survived']
a

In [130]:
help(max)
# 查看函数

Help on built-in function max in module builtins:

max(...)
    max(iterable, *[, default=obj, key=func]) -> value
    max(arg1, arg2, *args, *[, key=func]) -> value

    With a single iterable argument, return its biggest item. The
    default keyword-only argument specifies an object to return if
    the provided iterable is empty.
    With two or more arguments, return the largest argument.

In [131]:
help(a.aggregate)
# 查看函数

Help on method aggregate in module pandas.core.groupby.generic:

aggregate(func=None, *args, **kwargs) method of pandas.core.groupby.generic.SeriesGroupBy instance
    Aggregate using one or more operations over the specified axis.

    Parameters
    ----------
    func : function, str, list or dict
        Function to use for aggregating the data. If a function, must either
        work when passed a Series or when passed to Series.apply.

        Accepted combinations are:

        - function
        - string function name
        - list of functions and/or function names, e.g. ``[np.sum, 'mean']``
        - dict of axis labels -> functions, function names or list of such.

    *args
        Positional arguments to pass to `func`.
    **kwargs
        Keyword arguments to pass to `func`.

    Returns
    -------
    scalar, Series or DataFrame

        The return can be:

        * scalar : when Series.agg is called with single function
        * Series : when DataFrame.agg is called with a single function
        * DataFrame : when DataFrame.agg is called with several functions

        Return scalar, Series or DataFrame.

    See Also
    --------
    pandas.Series.groupby.apply
    pandas.Series.groupby.transform
    pandas.Series.aggregate

    Notes
    -----
    `agg` is an alias for `aggregate`. Use the alias.

    A passed user-defined-function will be passed a Series for evaluation.

    Examples
    --------
    >>> s = pd.Series([1, 2, 3, 4])

    >>> s
    0    1
    1    2
    2    3
    3    4
    dtype: int64

    >>> s.groupby([1, 1, 2, 2]).min()
    1    1
    2    3
    dtype: int64

    >>> s.groupby([1, 1, 2, 2]).agg('min')
    1    1
    2    3
    dtype: int64

    >>> s.groupby([1, 1, 2, 2]).agg(['min', 'max'])
       min  max
    1    1    2
    2    3    4

    The output column names can be controlled by passing
    the desired column names and aggregations as keyword arguments.

    >>> s.groupby([1, 1, 2, 2]).agg(
    ...     minimum='min',
    ...     maximum='max',
    ... )
       minimum  maximum
    1        1        2
    2        3        4

In [125]:
a.agg(['mean','max'])
# aggregate 简写 agg

                   mean  max
sex    class
female First   0.968085    1
       Second  0.921053    1
       Third   0.500000    1
male   First   0.368852    1
       Second  0.157407    1
       Third   0.135447    1

In [123]:
a.aggregate(['mean','max'])

                   mean  max
sex    class
female First   0.968085    1
       Second  0.921053    1
       Third   0.500000    1
male   First   0.368852    1
       Second  0.157407    1
       Third   0.135447    1

In [100]:
# pd.pivot_table()

In [101]:
"""
pd.pivot_table(
    data,
    values=None,
    index=None,
    columns=None,
    aggfunc='mean',
    fill_value=None,
    margins=False,
    dropna=True,
    margins_name='All',
    observed=False,
) -> 'DataFrame'
"""

"\npd.pivot_table(\n    data,\n    values=None,\n    index=None,\n    columns=None,\n    aggfunc='mean',\n    fill_value=None,\n    margins=False,\n    dropna=True,\n    margins_name='All',\n    observed=False,\n) -> 'DataFrame'\n"

In [102]:
d = pd.pivot_table(
    data = t, # 数据
    values = 'survived', # 值
    index = 'sex', # 要看的性别
    columns = 'class', # 列
    aggfunc = 'mean' # 均值
                  )
d

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [103]:
t.groupby(['sex','class'])['survived'].mean()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [104]:
# .unstack() 列转行
t.groupby(['sex','class'])['survived'].mean() \
.unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [105]:
# .unstack() 列转行
t.groupby(['sex','class'])['survived'].mean() \
.unstack(level = -1)

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [106]:
# .unstack() 列转行
t.groupby(['sex','class'])['survived'] \
.aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [107]:
# .stack() 行转列
t.groupby(['sex','class'])['survived'].mean().unstack() \
.stack()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
dtype: float64

In [108]:
# .stack() 行转列
t.groupby(['sex','class'])['survived'].mean().unstack(level = 0) \
.stack()

class   sex
First   female    0.968085
        male      0.368852
Second  female    0.921053
        male      0.157407
Third   female    0.500000
        male      0.135447
dtype: float64

In [109]:
pd.pivot_table(
    data = t,
    values = 'fare',
    index = 'sex',
    columns = 'class',
    aggfunc = 'mean'
)

class        First     Second      Third
sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [110]:
pd.pivot_table(
    data = t,
    values = 'fare',
    index = 'sex',
    columns = ['alone','class'], # 先写的在上面
    aggfunc = 'mean'
)

alone        False                             True
class        First     Second      Third       First     Second     Third
sex
female  106.219445  27.916761  21.750298  105.960538  13.793491  8.234727
male    103.488123  30.850811  22.693076   44.501943  14.187268  9.507808

In [111]:
pd.pivot_table(
    data = t,
    values = 'fare',
    index = 'sex',
    columns = ['class','alone'],
    aggfunc = 'mean'
)

class        First                 Second                 Third
alone        False       True       False      True       False     True
sex
female  106.219445  105.960538  27.916761  13.793491  21.750298  8.234727
male    103.488123   44.501943  30.850811  14.187268  22.693076  9.507808

In [112]:
pd.pivot_table(
    data = t,
    values = ['survived','fare','age'],
    index = 'sex',
    columns = 'class',
    aggfunc = {"survived":np.mean, \
                "fare":np.mean, \
               "age":np.max}
)

         age                     fare                        survived  \
class  First Second Third       First     Second      Third     First
sex
female  63.0   57.0  63.0  106.125798  21.970121  16.118810  0.968085
male    80.0   70.0  74.0   67.226127  19.741782  12.661633  0.368852


class     Second     Third
sex
female  0.921053  0.500000
male    0.157407  0.135447

In [117]:
pd.pivot_table(
    data = t,
    values = ['survived','fare'],
    index = 'sex',
    columns = 'class',
    aggfunc = {"survived":np.mean, \
                "fare":np.median, \
               }# 函数的个数*columns里的列的个数
)

            fare                 survived
class      First Second   Third     First    Second     Third
sex
female  82.66455   22.0  12.475  0.968085  0.921053  0.500000
male    41.26250   13.0   7.925  0.368852  0.157407  0.135447

In [118]:
t.groupby(by = ['sex','class'])['survived'].mean()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [119]:
t.groupby(by = ['sex','class'])['survived'].mean().unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [51]:
pd.pivot_table(
    data = t,
    values = ['survived'],
    index = 'sex',
    columns = 'class',
    aggfunc = [np.mean,np.max,np.median] 
    #笛卡尔积函数的个数*columns里的列的个数
)

            mean                         amax                median         \
        survived                     survived              survived
class      First    Second     Third    First Second Third    First Second
sex
female  0.968085  0.921053  0.500000        1      1     1      1.0    1.0
male    0.368852  0.157407  0.135447        1      1     1      0.0    0.0



class  Third
sex
female   0.5
male     0.0

In [19]:
t.groupby(['sex','class'])['survived'].mean() \
.unstack().unstack()

class   sex
First   female    0.968085
        male      0.368852
Second  female    0.921053
        male      0.157407
Third   female    0.500000
        male      0.135447
dtype: float64

In [20]:
# 分桶 cut
pd.cut(t['age'],[0,18,30,80])

0      (18.0, 30.0]
1      (30.0, 80.0]
2      (18.0, 30.0]
3      (30.0, 80.0]
4      (30.0, 80.0]
           ...
886    (18.0, 30.0]
887    (18.0, 30.0]
888             NaN
889    (18.0, 30.0]
890    (30.0, 80.0]
Name: age, Length: 891, dtype: category
Categories (3, interval[int64]): [(0, 18] < (18, 30] < (30, 80]]

In [21]:
# bins 等距分
pd.cut(t['age'],bins = [0,18,30,80])

0      (18.0, 30.0]
1      (30.0, 80.0]
2      (18.0, 30.0]
3      (30.0, 80.0]
4      (30.0, 80.0]
           ...
886    (18.0, 30.0]
887    (18.0, 30.0]
888             NaN
889    (18.0, 30.0]
890    (30.0, 80.0]
Name: age, Length: 891, dtype: category
Categories (3, interval[int64]): [(0, 18] < (18, 30] < (30, 80]]

In [22]:
pd.cut(t['age'],bins = 5)

0      (16.336, 32.252]
1      (32.252, 48.168]
2      (16.336, 32.252]
3      (32.252, 48.168]
4      (32.252, 48.168]
             ...
886    (16.336, 32.252]
887    (16.336, 32.252]
888                 NaN
889    (16.336, 32.252]
890    (16.336, 32.252]
Name: age, Length: 891, dtype: category
Categories (5, interval[float64]): [(0.34, 16.336] < (16.336, 32.252] < (32.252, 48.168] < (48.168, 64.084] < (64.084, 80.0]]

In [23]:
t['age'].min()

0.42

In [24]:
t['age'].max()

80.0

In [25]:
0.42 * 12

5.04

In [26]:
t.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [27]:
"""
pd.cut(
    x, # 带分的值
    bins, # 分几份
    right: bool = True,
    labels=None, # 标签 
    retbins: bool = False,
    precision: int = 3,
    include_lowest: bool = False,
    duplicates: str = 'raise',
)
"""

"\npd.cut(\n    x, # 带分的值\n    bins, # 分几份\n    right: bool = True,\n    labels=None, # 标签 \n    retbins: bool = False,\n    precision: int = 3,\n    include_lowest: bool = False,\n    duplicates: str = 'raise',\n)\n"

In [28]:
# bins 几个区间
# labels 标签
age = pd.cut(
    t['age'],
    bins = 4,
    labels = ['青年','中年','老年','知天命']
)

In [29]:
t.pivot_table(
    values = 'survived',
    index = ['sex',age])

            survived
sex    age
female 青年   0.688312
       中年   0.786765
       老年   0.755556
       知天命  1.000000
male   青年   0.284314
       中年   0.184739
       老年   0.192771
       知天命  0.105263

In [30]:
pd.qcut(t['fare'],2)
# 等频分:频率一致(分位数分箱):每个组的个数相同

0       (-0.001, 14.454]
1      (14.454, 512.329]
2       (-0.001, 14.454]
3      (14.454, 512.329]
4       (-0.001, 14.454]
             ...
886     (-0.001, 14.454]
887    (14.454, 512.329]
888    (14.454, 512.329]
889    (14.454, 512.329]
890     (-0.001, 14.454]
Name: fare, Length: 891, dtype: category
Categories (2, interval[float64]): [(-0.001, 14.454] < (14.454, 512.329]]

In [56]:
pd.qcut(t['fare'],[0, .25, .5, .75, 1.])

0       (-0.001, 7.91]
1      (31.0, 512.329]
2       (7.91, 14.454]
3      (31.0, 512.329]
4       (7.91, 14.454]
            ...
886     (7.91, 14.454]
887     (14.454, 31.0]
888     (14.454, 31.0]
889     (14.454, 31.0]
890     (-0.001, 7.91]
Name: fare, Length: 891, dtype: category
Categories (4, interval[float64]): [(-0.001, 7.91] < (7.91, 14.454] < (14.454, 31.0] < (31.0, 512.329]]

In [87]:
a = pd.qcut(
    t['age'],
    [0, .1, .5, .8, 1.],
    labels = ['一','二','三','四'])
# 计算每个桶的个数

In [88]:
a.value_counts()

二    285
三    210
四    142
一     77
Name: age, dtype: int64

In [89]:
a.count()

714

In [91]:
285+210+142+77

714